docs/plans/20260528T003512Z_inflection_controller_rulegraphs/dot/no_segdup.rulegraph.dot
digraph snakemake_dag {
    graph[bgcolor=white, margin=0];
    node[shape=box, style=rounded, fontname=sans,                 fontsize=10, penwidth=2];
    edge[penwidth=2, color=grey];
	0[label = "produce_dmd_dedup_cram", color = "0.37 0.6 0.85", style="rounded"];
	1[label = "doppelmark_dups", color = "0.54 0.6 0.85", style="rounded"];
	2[label = "sentieon_bwa_sort", color = "0.62 0.6 0.85", style="rounded"];
	3[label = "prep_results_dirs", color = "0.52 0.6 0.85", style="rounded"];
	4[label = "workflow_staging", color = "0.03 0.6 0.85", style="rounded"];
	5[label = "stage_supporting_data", color = "0.46 0.6 0.85", style="rounded"];
	6[label = "pre_prep_raw_fq", color = "0.65 0.6 0.85", style="rounded"];
	7[label = "produce_expansionhunter", color = "0.61 0.6 0.85", style="rounded"];
	8[label = "expansionhunter_json_to_tsv", color = "0.40 0.6 0.85", style="rounded"];
	9[label = "expansionhunter_call", color = "0.38 0.6 0.85", style="rounded"];
	10[label = "produce_sentdhiomr_mito", color = "0.18 0.6 0.85", style="rounded"];
	11[label = "sentdhiomr_mito_call", color = "0.28 0.6 0.85", style="rounded"];
	12[label = "sentdhiomr_merge_sr_bams", color = "0.61 0.6 0.85", style="rounded"];
	13[label = "sentdhiomr_sr_markdup", color = "0.20 0.6 0.85", style="rounded"];
	14[label = "sentdhiomr_sr_align", color = "0.13 0.6 0.85", style="rounded"];
	15[label = "pre_prep_ont_cram", color = "0.55 0.6 0.85", style="rounded"];
	16[label = "produce_sentdhiomr_sv", color = "0.27 0.6 0.85", style="rounded"];
	17[label = "sentdhiomr_call_svs", color = "0.21 0.6 0.85", style="rounded"];
	18[label = "produce_sent_align", color = "0.44 0.6 0.85", style="rounded"];
	19[label = "produce_sentdhiomr_snv_vcf", color = "0.15 0.6 0.85", style="rounded"];
	20[label = "sentdhiomr_concat_index_chunks", color = "0.42 0.6 0.85", style="rounded"];
	21[label = "sentdhiomr_concat_fofn", color = "0.05 0.6 0.85", style="rounded"];
	22[label = "sentdhiomr_final_norm", color = "0.23 0.6 0.85", style="rounded"];
	23[label = "sentdhiomr_model_apply", color = "0.65 0.6 0.85", style="rounded"];
	24[label = "sentdhiomr_transfer_merge", color = "0.46 0.6 0.85", style="rounded"];
	25[label = "sentdhiomr_transfer", color = "0.42 0.6 0.85", style="rounded"];
	26[label = "sentdhiomr_anno", color = "0.50 0.6 0.85", style="rounded"];
	27[label = "sentdhiomr_concat_pass", color = "0.45 0.6 0.85", style="rounded"];
	28[label = "sentdhiomr_subset", color = "0.18 0.6 0.85", style="rounded"];
	29[label = "sentdhiomr_pass1", color = "0.24 0.6 0.85", style="rounded"];
	30[label = "sentdhiomr_stage2", color = "0.10 0.6 0.85", style="rounded"];
	31[label = "sentdhiomr_stage1", color = "0.21 0.6 0.85", style="rounded"];
	32[label = "sentdhiomr_merge_beds", color = "0.20 0.6 0.85", style="rounded"];
	33[label = "sentdhiomr_hybrid_select", color = "0.13 0.6 0.85", style="rounded"];
	34[label = "sentdhiomr_mapq0_slop", color = "0.22 0.6 0.85", style="rounded"];
	35[label = "sentdhiomr_mapq0_bed", color = "0.51 0.6 0.85", style="rounded"];
	36[label = "sentdhiomr_pass2", color = "0.16 0.6 0.85", style="rounded"];
	37[label = "sentdhiomr_stage3", color = "0.43 0.6 0.85", style="rounded"];
	38[label = "produce_sentdhiomr_cnv", color = "0.04 0.6 0.85", style="rounded"];
	39[label = "sentdhiomr_call_cnvs", color = "0.06 0.6 0.85", style="rounded"];
	40[label = "produce_snv_concordances", color = "0.58 0.6 0.85", style="rounded"];
	41[label = "prep_for_concordance_check", color = "0.05 0.6 0.85", style="rounded"];
	42[label = "parse_vcfeval_summary_roi", color = "0.42 0.6 0.85", style="rounded"];
	43[label = "rtg_vcfeval_roi", color = "0.60 0.6 0.85", style="rounded"];
	1 -> 0
	2 -> 1
	3 -> 2
	6 -> 2
	4 -> 3
	5 -> 4
	8 -> 7
	9 -> 8
	1 -> 9
	11 -> 10
	12 -> 11
	13 -> 12
	14 -> 13
	3 -> 14
	6 -> 14
	15 -> 14
	17 -> 16
	15 -> 17
	2 -> 18
	20 -> 19
	21 -> 20
	22 -> 21
	23 -> 22
	24 -> 23
	25 -> 24
	26 -> 25
	31 -> 26
	27 -> 26
	36 -> 27
	28 -> 27
	30 -> 28
	29 -> 28
	13 -> 29
	15 -> 29
	31 -> 30
	15 -> 31
	32 -> 31
	34 -> 32
	33 -> 32
	29 -> 33
	35 -> 34
	13 -> 35
	15 -> 35
	30 -> 36
	29 -> 36
	15 -> 36
	37 -> 36
	13 -> 37
	15 -> 37
	30 -> 37
	39 -> 38
	12 -> 39
	42 -> 40
	41 -> 40
	20 -> 41
	42 -> 41
	43 -> 42
	20 -> 43
}
